//四十句金口定

pub fn jkd() {
    println!("::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::");
    println!("info: 四十句金口定:\n");
    println!(
        "马前只用四正神 青白朱玄顺位跟 月上起日循环落 时辰落宫最为真
青龙抬头贵人来 婚姻喜动挂红彩 枯木逢春花自开 交易买卖必得财
大忌金星时欠债 须防女人暗中灾 不利私情两分拆 远走低谷三五载 
逆水行舟心无耐 老君赐符保守泰
下山白虎张口来 失去财物见血灾 婚姻破败官司债 病人及早备棺材 
白虎遇火事无碍 反而求吉得官拜 寅午戌年顺位排 运足必然官贵抬
最怕巳亥年运来 官司疾病破血财
朱雀迷窝喜连连 交易买卖万贯钱 婚姻合和人团圆 文书行人共周全 
水星大忌是空玄 官府门前放恶犬 猪犬小人事不圆 切莫为人抛钱财
合伙事业入火圈 破财口舌闹喧喧
玄武架桥水路过 土星破财必有祸 婚姻反复花自落 莫娶牛羊鸡老婆 
可去庙中敬神佛 月过二八必喜悦
玄武最忌土星卧 若见金木也欢乐 房车半吉安稳步 也可成功喜洋说 
纵是囚弑也身脱 四十八句金口定 吉凶福祸已说清 留与世人细分明 
"
    );
}
